import 'dart:math';

void main() {
  runTask1();
}

void runTask1() {
  print('------------------- Task 1 -------------------');
  // 1. Створіть список numbers зі 100 елементів. Кожен елемент — випадкове число від 0 до 100 (використайте Random().nextInt(101)).
  final List<int> numbers = List.generate(
    100,
    (index) => Random().nextInt(101),
  );

  // 2. Виведіть цей список на екран.
  print(numbers);

  // 3. Виведіть на екран 65-й елемент списку у форматі: "65-й елемент: [значення]".
  print("65-й елемент: ${numbers[64]}");

  // 4.Вставте число 1000000000 на 50-ту позицію списку.
  numbers.insert(50, 1000000000);

  // 5. Видаліть зі списку елементи зі значеннями: 24, 45, 66, 88.
  numbers.removeWhere((element) => [24, 45, 66, 88].contains(element));

  // 6. За допомогою циклу for переберіть список. Під час перебору:
  // Порахуйте суму всіх елементів, що діляться на 3 без залишку. Виведіть результат.
  int sum = 0;
  for (int number in numbers) {
    if (number % 3 == 0) {
      sum += number;
    }
  }
  print("Сума всіх елементів, що діляться на 3 без залишку: $sum");

  // 7. Створіть порожній список temp. За допомогою циклу for-in переберіть numbers.
  // Додайте до temp лише ті елементи, що діляться на 2 без залишку.
  final List<int> temp = [];
  for (int number in numbers) {
    if (number % 2 == 0) {
      temp.add(number);
    }
  }
  print("Список елементів, що діляться на 2 без залишку");
  print(temp);

  // 8. Виведіть довжину списку temp.
  print(
    "Довжина списку елементів, що діляться на 2 без залишку: ${temp.length}",
  );
}
